<template>
  <BaseHeader />
  <main>
    <h2 class="p-4 text-center">新着アニメ</h2>
    <v-container class="position-relative">
      <v-row align="start" class="more_contents">
        <AnimeCard
          v-for="anime in displayAnimeList"
          :key="anime.id"
          :id="anime.id"
          :anime-name="anime.animeName"
          :category="anime.category"
          :rating="anime.rating"
          :synopsis="anime.synopsis"
          :key-visual="anime.keyVisual"
          :key-visual-reference="anime.keyVisualReference"
        />
      </v-row>
      <AtomToAnimeListButton v-if="showMoreButton" />
    </v-container>
  </main>
  <BaseFooter />
  <Snackbar />
</template>

<script setup>
import { ref, onMounted } from 'vue';
import Snackbar from '../components/Snackbar.vue';
import AnimeCard from '../components/AnimeCard.vue';
import AtomToAnimeListButton from '../atoms/button/AtomToAnimeListButton.vue';
import { useFetchAnimeList } from '../composables/useFetchAnimeList';
import { useHelpers } from '../composables/useHelpers';

const { fetchAnimeList } = useFetchAnimeList();
const helpers = useHelpers();
const maxAnimeItems = 20;
let showMoreButton = ref(true);
let displayAnimeList = {};

// アニメ一覧取得
(async () => {
  const animeList = await fetchAnimeList();
  if (animeList === null) {
    return;
  }
  // 20件にslice
  displayAnimeList = helpers.sliceArray(
    animeList,
    maxAnimeItems
  );
})();

onMounted(() => {
  // 20件未満はもっと見るボタン、グラデーションクラスを削除
  if (displayAnimeList.length < 20) {
    showMoreButton.value = false;
    document
      .getElementsByClassName('more_contents')[0]
      .classList.remove('more_contents');
  }
});

// dummy
let animeList = [
  {
    id: 1,
    animeName:
      '秋桜丘高校舞台裏クラブ 〜星の輝き、未知の舞台へ〜これは、世界を舞台に繰り広げられる、知られざる高校生たちの物語。学園の舞台裏で奏でられる感動と謎の数々。本物の友情、夢、そして探求心。全てがここに綴られていく。',
    category: '学園',
    rating: '4.5',
    synopsis:
      '「セレスティア・アカデミア・アストラリス」という星降る学園、その名は世界中の人々によって称賛され、その輝きは夜空の星々に匹敵します。学園には、魔法、科学、芸術、文学、スポーツなど、多様な分野の才能ある生徒たちが集い、未知の可能性を求めて日夜努力しています。主人公、リュナ・スターブレイカーは、この学園に入学し、不思議な友情を築きます。ある日、星降りる夜に、彼女と仲間たちは不思議な冒険に出発します。彼らは、学園の秘密と星座の力を探求し、古代の魔法と明日への約束の物語に巻き込まれます。しかし、彼らの冒険は友情の奇跡と魔法の謎解きという試練の連続で、セレスティア学園が隠している秘密の闇が次第に明るみに出てきます。リュナと彼女の仲間たちは、運命と魔法の力で未来を切り拓く旅に出ます。',
    keyVisual: '/image/dummy.png',
    keyVisualReference: '© xyz制作より引用',
  },
  {
    id: 2,
    animeName: 'スターシャインの冒険',
    category: 'SF',
    rating: '5',
    synopsis:
      '未来の地球、2075年。人類は宇宙探査に成功し、銀河系の新たな惑星への移住を始めています。しかし、一組の双子、アリアとカイが出会ったことで、銀河全体に響く大きな秘密が明らかになります。アリアは科学と技術に優れ、未知の領域への探索を担当しています。一方、カイは直感力に長け、未来を予知することができる力を持っています。この力は、彼らが宇宙の危機に立ち向かう際に鍵となります。星の双子は、新たな惑星での冒険や異星人たちとの交流を通じて、人類の未来と銀河の運命に深く関わっていくことになります。彼らの冒険がSFの世界で繰り広げられます。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 3,
    animeName: '闇に呼ばれし者',
    category: 'ホラー',
    rating: '4',
    synopsis:
      '町は古く、森に囲まれた閉鎖的な場所。住民たちは長い間、巷に囁かれる「闇の鎖」の伝説を恐れてきました。それは、森の中に封じられた邪悪な存在が、一世紀ごとに町に現れ、生贄を求めて若い者たちを消えさせるという恐るべき伝説です。物語は、町に住む若者、ミカエルとエレナが中心となります。二人は「闇の鎖」の脅威に立ち向かう決意をし、町の秘密を解明しようとします。彼らは森に足を踏み入れ、伝説の真実を明らかにしようとします。しかし、森の中で二人は奇怪な出来事や幻覚に見舞われ、自分たちの運命に翻弄されていきます。町の住民たちは彼らの助けを求めますが、真実は次第に明らかになり、恐ろしい選択を迫られることになります。"闇の鎖" は、恐怖とサスペンスが絶妙に組み合わさったホラーアニメで、主人公たちが闇の中で闘い、自らの運命に立ち向かう姿を描いています。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 1,
    animeName:
      '秋桜丘高校舞台裏クラブ 〜星の輝き、未知の舞台へ〜これは、世界を舞台に繰り広げられる、知られざる高校生たちの物語。学園の舞台裏で奏でられる感動と謎の数々。本物の友情、夢、そして探求心。全てがここに綴られていく。',
    category: '学園',
    rating: '4.5',
    synopsis:
      '「セレスティア・アカデミア・アストラリス」という星降る学園、その名は世界中の人々によって称賛され、その輝きは夜空の星々に匹敵します。学園には、魔法、科学、芸術、文学、スポーツなど、多様な分野の才能ある生徒たちが集い、未知の可能性を求めて日夜努力しています。主人公、リュナ・スターブレイカーは、この学園に入学し、不思議な友情を築きます。ある日、星降りる夜に、彼女と仲間たちは不思議な冒険に出発します。彼らは、学園の秘密と星座の力を探求し、古代の魔法と明日への約束の物語に巻き込まれます。しかし、彼らの冒険は友情の奇跡と魔法の謎解きという試練の連続で、セレスティア学園が隠している秘密の闇が次第に明るみに出てきます。リュナと彼女の仲間たちは、運命と魔法の力で未来を切り拓く旅に出ます。',
    keyVisual: '/image/dummy.png',
    keyVisualReference: '© xyz制作より引用',
  },
  {
    id: 2,
    animeName: 'スターシャインの冒険',
    category: 'SF',
    rating: '5',
    synopsis:
      '未来の地球、2075年。人類は宇宙探査に成功し、銀河系の新たな惑星への移住を始めています。しかし、一組の双子、アリアとカイが出会ったことで、銀河全体に響く大きな秘密が明らかになります。アリアは科学と技術に優れ、未知の領域への探索を担当しています。一方、カイは直感力に長け、未来を予知することができる力を持っています。この力は、彼らが宇宙の危機に立ち向かう際に鍵となります。星の双子は、新たな惑星での冒険や異星人たちとの交流を通じて、人類の未来と銀河の運命に深く関わっていくことになります。彼らの冒険がSFの世界で繰り広げられます。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 3,
    animeName: '闇に呼ばれし者',
    category: 'ホラー',
    rating: '4',
    synopsis:
      '町は古く、森に囲まれた閉鎖的な場所。住民たちは長い間、巷に囁かれる「闇の鎖」の伝説を恐れてきました。それは、森の中に封じられた邪悪な存在が、一世紀ごとに町に現れ、生贄を求めて若い者たちを消えさせるという恐るべき伝説です。物語は、町に住む若者、ミカエルとエレナが中心となります。二人は「闇の鎖」の脅威に立ち向かう決意をし、町の秘密を解明しようとします。彼らは森に足を踏み入れ、伝説の真実を明らかにしようとします。しかし、森の中で二人は奇怪な出来事や幻覚に見舞われ、自分たちの運命に翻弄されていきます。町の住民たちは彼らの助けを求めますが、真実は次第に明らかになり、恐ろしい選択を迫られることになります。"闇の鎖" は、恐怖とサスペンスが絶妙に組み合わさったホラーアニメで、主人公たちが闇の中で闘い、自らの運命に立ち向かう姿を描いています。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 1,
    animeName:
      '秋桜丘高校舞台裏クラブ 〜星の輝き、未知の舞台へ〜これは、世界を舞台に繰り広げられる、知られざる高校生たちの物語。学園の舞台裏で奏でられる感動と謎の数々。本物の友情、夢、そして探求心。全てがここに綴られていく。',
    category: '学園',
    rating: '4.5',
    synopsis:
      '「セレスティア・アカデミア・アストラリス」という星降る学園、その名は世界中の人々によって称賛され、その輝きは夜空の星々に匹敵します。学園には、魔法、科学、芸術、文学、スポーツなど、多様な分野の才能ある生徒たちが集い、未知の可能性を求めて日夜努力しています。主人公、リュナ・スターブレイカーは、この学園に入学し、不思議な友情を築きます。ある日、星降りる夜に、彼女と仲間たちは不思議な冒険に出発します。彼らは、学園の秘密と星座の力を探求し、古代の魔法と明日への約束の物語に巻き込まれます。しかし、彼らの冒険は友情の奇跡と魔法の謎解きという試練の連続で、セレスティア学園が隠している秘密の闇が次第に明るみに出てきます。リュナと彼女の仲間たちは、運命と魔法の力で未来を切り拓く旅に出ます。',
    keyVisual: '/image/dummy.png',
    keyVisualReference: '© xyz制作より引用',
  },
  {
    id: 2,
    animeName: 'スターシャインの冒険',
    category: 'SF',
    rating: '5',
    synopsis:
      '未来の地球、2075年。人類は宇宙探査に成功し、銀河系の新たな惑星への移住を始めています。しかし、一組の双子、アリアとカイが出会ったことで、銀河全体に響く大きな秘密が明らかになります。アリアは科学と技術に優れ、未知の領域への探索を担当しています。一方、カイは直感力に長け、未来を予知することができる力を持っています。この力は、彼らが宇宙の危機に立ち向かう際に鍵となります。星の双子は、新たな惑星での冒険や異星人たちとの交流を通じて、人類の未来と銀河の運命に深く関わっていくことになります。彼らの冒険がSFの世界で繰り広げられます。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 3,
    animeName: '闇に呼ばれし者',
    category: 'ホラー',
    rating: '4',
    synopsis:
      '町は古く、森に囲まれた閉鎖的な場所。住民たちは長い間、巷に囁かれる「闇の鎖」の伝説を恐れてきました。それは、森の中に封じられた邪悪な存在が、一世紀ごとに町に現れ、生贄を求めて若い者たちを消えさせるという恐るべき伝説です。物語は、町に住む若者、ミカエルとエレナが中心となります。二人は「闇の鎖」の脅威に立ち向かう決意をし、町の秘密を解明しようとします。彼らは森に足を踏み入れ、伝説の真実を明らかにしようとします。しかし、森の中で二人は奇怪な出来事や幻覚に見舞われ、自分たちの運命に翻弄されていきます。町の住民たちは彼らの助けを求めますが、真実は次第に明らかになり、恐ろしい選択を迫られることになります。"闇の鎖" は、恐怖とサスペンスが絶妙に組み合わさったホラーアニメで、主人公たちが闇の中で闘い、自らの運命に立ち向かう姿を描いています。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 1,
    animeName:
      '秋桜丘高校舞台裏クラブ 〜星の輝き、未知の舞台へ〜これは、世界を舞台に繰り広げられる、知られざる高校生たちの物語。学園の舞台裏で奏でられる感動と謎の数々。本物の友情、夢、そして探求心。全てがここに綴られていく。',
    category: '学園',
    rating: '4.5',
    synopsis:
      '「セレスティア・アカデミア・アストラリス」という星降る学園、その名は世界中の人々によって称賛され、その輝きは夜空の星々に匹敵します。学園には、魔法、科学、芸術、文学、スポーツなど、多様な分野の才能ある生徒たちが集い、未知の可能性を求めて日夜努力しています。主人公、リュナ・スターブレイカーは、この学園に入学し、不思議な友情を築きます。ある日、星降りる夜に、彼女と仲間たちは不思議な冒険に出発します。彼らは、学園の秘密と星座の力を探求し、古代の魔法と明日への約束の物語に巻き込まれます。しかし、彼らの冒険は友情の奇跡と魔法の謎解きという試練の連続で、セレスティア学園が隠している秘密の闇が次第に明るみに出てきます。リュナと彼女の仲間たちは、運命と魔法の力で未来を切り拓く旅に出ます。',
    keyVisual: '/image/dummy.png',
    keyVisualReference: '© xyz制作より引用',
  },
  {
    id: 2,
    animeName: 'スターシャインの冒険',
    category: 'SF',
    rating: '5',
    synopsis:
      '未来の地球、2075年。人類は宇宙探査に成功し、銀河系の新たな惑星への移住を始めています。しかし、一組の双子、アリアとカイが出会ったことで、銀河全体に響く大きな秘密が明らかになります。アリアは科学と技術に優れ、未知の領域への探索を担当しています。一方、カイは直感力に長け、未来を予知することができる力を持っています。この力は、彼らが宇宙の危機に立ち向かう際に鍵となります。星の双子は、新たな惑星での冒険や異星人たちとの交流を通じて、人類の未来と銀河の運命に深く関わっていくことになります。彼らの冒険がSFの世界で繰り広げられます。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 3,
    animeName: '闇に呼ばれし者',
    category: 'ホラー',
    rating: '4',
    synopsis:
      '町は古く、森に囲まれた閉鎖的な場所。住民たちは長い間、巷に囁かれる「闇の鎖」の伝説を恐れてきました。それは、森の中に封じられた邪悪な存在が、一世紀ごとに町に現れ、生贄を求めて若い者たちを消えさせるという恐るべき伝説です。物語は、町に住む若者、ミカエルとエレナが中心となります。二人は「闇の鎖」の脅威に立ち向かう決意をし、町の秘密を解明しようとします。彼らは森に足を踏み入れ、伝説の真実を明らかにしようとします。しかし、森の中で二人は奇怪な出来事や幻覚に見舞われ、自分たちの運命に翻弄されていきます。町の住民たちは彼らの助けを求めますが、真実は次第に明らかになり、恐ろしい選択を迫られることになります。"闇の鎖" は、恐怖とサスペンスが絶妙に組み合わさったホラーアニメで、主人公たちが闇の中で闘い、自らの運命に立ち向かう姿を描いています。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 1,
    animeName:
      '秋桜丘高校舞台裏クラブ 〜星の輝き、未知の舞台へ〜これは、世界を舞台に繰り広げられる、知られざる高校生たちの物語。学園の舞台裏で奏でられる感動と謎の数々。本物の友情、夢、そして探求心。全てがここに綴られていく。',
    category: '学園',
    rating: '4.5',
    synopsis:
      '「セレスティア・アカデミア・アストラリス」という星降る学園、その名は世界中の人々によって称賛され、その輝きは夜空の星々に匹敵します。学園には、魔法、科学、芸術、文学、スポーツなど、多様な分野の才能ある生徒たちが集い、未知の可能性を求めて日夜努力しています。主人公、リュナ・スターブレイカーは、この学園に入学し、不思議な友情を築きます。ある日、星降りる夜に、彼女と仲間たちは不思議な冒険に出発します。彼らは、学園の秘密と星座の力を探求し、古代の魔法と明日への約束の物語に巻き込まれます。しかし、彼らの冒険は友情の奇跡と魔法の謎解きという試練の連続で、セレスティア学園が隠している秘密の闇が次第に明るみに出てきます。リュナと彼女の仲間たちは、運命と魔法の力で未来を切り拓く旅に出ます。',
    keyVisual: '/image/dummy.png',
    keyVisualReference: '© xyz制作より引用',
  },
  {
    id: 2,
    animeName: 'スターシャインの冒険',
    category: 'SF',
    rating: '5',
    synopsis:
      '未来の地球、2075年。人類は宇宙探査に成功し、銀河系の新たな惑星への移住を始めています。しかし、一組の双子、アリアとカイが出会ったことで、銀河全体に響く大きな秘密が明らかになります。アリアは科学と技術に優れ、未知の領域への探索を担当しています。一方、カイは直感力に長け、未来を予知することができる力を持っています。この力は、彼らが宇宙の危機に立ち向かう際に鍵となります。星の双子は、新たな惑星での冒険や異星人たちとの交流を通じて、人類の未来と銀河の運命に深く関わっていくことになります。彼らの冒険がSFの世界で繰り広げられます。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 3,
    animeName: '闇に呼ばれし者',
    category: 'ホラー',
    rating: '4',
    synopsis:
      '町は古く、森に囲まれた閉鎖的な場所。住民たちは長い間、巷に囁かれる「闇の鎖」の伝説を恐れてきました。それは、森の中に封じられた邪悪な存在が、一世紀ごとに町に現れ、生贄を求めて若い者たちを消えさせるという恐るべき伝説です。物語は、町に住む若者、ミカエルとエレナが中心となります。二人は「闇の鎖」の脅威に立ち向かう決意をし、町の秘密を解明しようとします。彼らは森に足を踏み入れ、伝説の真実を明らかにしようとします。しかし、森の中で二人は奇怪な出来事や幻覚に見舞われ、自分たちの運命に翻弄されていきます。町の住民たちは彼らの助けを求めますが、真実は次第に明らかになり、恐ろしい選択を迫られることになります。"闇の鎖" は、恐怖とサスペンスが絶妙に組み合わさったホラーアニメで、主人公たちが闇の中で闘い、自らの運命に立ち向かう姿を描いています。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 1,
    animeName:
      '秋桜丘高校舞台裏クラブ 〜星の輝き、未知の舞台へ〜これは、世界を舞台に繰り広げられる、知られざる高校生たちの物語。学園の舞台裏で奏でられる感動と謎の数々。本物の友情、夢、そして探求心。全てがここに綴られていく。',
    category: '学園',
    rating: '4.5',
    synopsis:
      '「セレスティア・アカデミア・アストラリス」という星降る学園、その名は世界中の人々によって称賛され、その輝きは夜空の星々に匹敵します。学園には、魔法、科学、芸術、文学、スポーツなど、多様な分野の才能ある生徒たちが集い、未知の可能性を求めて日夜努力しています。主人公、リュナ・スターブレイカーは、この学園に入学し、不思議な友情を築きます。ある日、星降りる夜に、彼女と仲間たちは不思議な冒険に出発します。彼らは、学園の秘密と星座の力を探求し、古代の魔法と明日への約束の物語に巻き込まれます。しかし、彼らの冒険は友情の奇跡と魔法の謎解きという試練の連続で、セレスティア学園が隠している秘密の闇が次第に明るみに出てきます。リュナと彼女の仲間たちは、運命と魔法の力で未来を切り拓く旅に出ます。',
    keyVisual: '/image/dummy.png',
    keyVisualReference: '© xyz制作より引用',
  },
  {
    id: 2,
    animeName: 'スターシャインの冒険',
    category: 'SF',
    rating: '5',
    synopsis:
      '未来の地球、2075年。人類は宇宙探査に成功し、銀河系の新たな惑星への移住を始めています。しかし、一組の双子、アリアとカイが出会ったことで、銀河全体に響く大きな秘密が明らかになります。アリアは科学と技術に優れ、未知の領域への探索を担当しています。一方、カイは直感力に長け、未来を予知することができる力を持っています。この力は、彼らが宇宙の危機に立ち向かう際に鍵となります。星の双子は、新たな惑星での冒険や異星人たちとの交流を通じて、人類の未来と銀河の運命に深く関わっていくことになります。彼らの冒険がSFの世界で繰り広げられます。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 3,
    animeName: '闇に呼ばれし者',
    category: 'ホラー',
    rating: '4',
    synopsis:
      '町は古く、森に囲まれた閉鎖的な場所。住民たちは長い間、巷に囁かれる「闇の鎖」の伝説を恐れてきました。それは、森の中に封じられた邪悪な存在が、一世紀ごとに町に現れ、生贄を求めて若い者たちを消えさせるという恐るべき伝説です。物語は、町に住む若者、ミカエルとエレナが中心となります。二人は「闇の鎖」の脅威に立ち向かう決意をし、町の秘密を解明しようとします。彼らは森に足を踏み入れ、伝説の真実を明らかにしようとします。しかし、森の中で二人は奇怪な出来事や幻覚に見舞われ、自分たちの運命に翻弄されていきます。町の住民たちは彼らの助けを求めますが、真実は次第に明らかになり、恐ろしい選択を迫られることになります。"闇の鎖" は、恐怖とサスペンスが絶妙に組み合わさったホラーアニメで、主人公たちが闇の中で闘い、自らの運命に立ち向かう姿を描いています。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 1,
    animeName:
      '秋桜丘高校舞台裏クラブ 〜星の輝き、未知の舞台へ〜これは、世界を舞台に繰り広げられる、知られざる高校生たちの物語。学園の舞台裏で奏でられる感動と謎の数々。本物の友情、夢、そして探求心。全てがここに綴られていく。',
    category: '学園',
    rating: '4.5',
    synopsis:
      '「セレスティア・アカデミア・アストラリス」という星降る学園、その名は世界中の人々によって称賛され、その輝きは夜空の星々に匹敵します。学園には、魔法、科学、芸術、文学、スポーツなど、多様な分野の才能ある生徒たちが集い、未知の可能性を求めて日夜努力しています。主人公、リュナ・スターブレイカーは、この学園に入学し、不思議な友情を築きます。ある日、星降りる夜に、彼女と仲間たちは不思議な冒険に出発します。彼らは、学園の秘密と星座の力を探求し、古代の魔法と明日への約束の物語に巻き込まれます。しかし、彼らの冒険は友情の奇跡と魔法の謎解きという試練の連続で、セレスティア学園が隠している秘密の闇が次第に明るみに出てきます。リュナと彼女の仲間たちは、運命と魔法の力で未来を切り拓く旅に出ます。',
    keyVisual: '/image/dummy.png',
    keyVisualReference: '© xyz制作より引用',
  },
  {
    id: 2,
    animeName: 'スターシャインの冒険',
    category: 'SF',
    rating: '5',
    synopsis:
      '未来の地球、2075年。人類は宇宙探査に成功し、銀河系の新たな惑星への移住を始めています。しかし、一組の双子、アリアとカイが出会ったことで、銀河全体に響く大きな秘密が明らかになります。アリアは科学と技術に優れ、未知の領域への探索を担当しています。一方、カイは直感力に長け、未来を予知することができる力を持っています。この力は、彼らが宇宙の危機に立ち向かう際に鍵となります。星の双子は、新たな惑星での冒険や異星人たちとの交流を通じて、人類の未来と銀河の運命に深く関わっていくことになります。彼らの冒険がSFの世界で繰り広げられます。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 3,
    animeName: '闇に呼ばれし者',
    category: 'ホラー',
    rating: '4',
    synopsis:
      '町は古く、森に囲まれた閉鎖的な場所。住民たちは長い間、巷に囁かれる「闇の鎖」の伝説を恐れてきました。それは、森の中に封じられた邪悪な存在が、一世紀ごとに町に現れ、生贄を求めて若い者たちを消えさせるという恐るべき伝説です。物語は、町に住む若者、ミカエルとエレナが中心となります。二人は「闇の鎖」の脅威に立ち向かう決意をし、町の秘密を解明しようとします。彼らは森に足を踏み入れ、伝説の真実を明らかにしようとします。しかし、森の中で二人は奇怪な出来事や幻覚に見舞われ、自分たちの運命に翻弄されていきます。町の住民たちは彼らの助けを求めますが、真実は次第に明らかになり、恐ろしい選択を迫られることになります。"闇の鎖" は、恐怖とサスペンスが絶妙に組み合わさったホラーアニメで、主人公たちが闇の中で闘い、自らの運命に立ち向かう姿を描いています。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 1,
    animeName:
      '秋桜丘高校舞台裏クラブ 〜星の輝き、未知の舞台へ〜これは、世界を舞台に繰り広げられる、知られざる高校生たちの物語。学園の舞台裏で奏でられる感動と謎の数々。本物の友情、夢、そして探求心。全てがここに綴られていく。',
    category: '学園',
    rating: '4.5',
    synopsis:
      '「セレスティア・アカデミア・アストラリス」という星降る学園、その名は世界中の人々によって称賛され、その輝きは夜空の星々に匹敵します。学園には、魔法、科学、芸術、文学、スポーツなど、多様な分野の才能ある生徒たちが集い、未知の可能性を求めて日夜努力しています。主人公、リュナ・スターブレイカーは、この学園に入学し、不思議な友情を築きます。ある日、星降りる夜に、彼女と仲間たちは不思議な冒険に出発します。彼らは、学園の秘密と星座の力を探求し、古代の魔法と明日への約束の物語に巻き込まれます。しかし、彼らの冒険は友情の奇跡と魔法の謎解きという試練の連続で、セレスティア学園が隠している秘密の闇が次第に明るみに出てきます。リュナと彼女の仲間たちは、運命と魔法の力で未来を切り拓く旅に出ます。',
    keyVisual: '/image/dummy.png',
    keyVisualReference: '© xyz制作より引用',
  },
  {
    id: 2,
    animeName: 'スターシャインの冒険',
    category: 'SF',
    rating: '5',
    synopsis:
      '未来の地球、2075年。人類は宇宙探査に成功し、銀河系の新たな惑星への移住を始めています。しかし、一組の双子、アリアとカイが出会ったことで、銀河全体に響く大きな秘密が明らかになります。アリアは科学と技術に優れ、未知の領域への探索を担当しています。一方、カイは直感力に長け、未来を予知することができる力を持っています。この力は、彼らが宇宙の危機に立ち向かう際に鍵となります。星の双子は、新たな惑星での冒険や異星人たちとの交流を通じて、人類の未来と銀河の運命に深く関わっていくことになります。彼らの冒険がSFの世界で繰り広げられます。',
    keyVisual: '/image/dummy.png',
  },
  {
    id: 3,
    animeName: '闇に呼ばれし者',
    category: 'ホラー',
    rating: '4',
    synopsis:
      '町は古く、森に囲まれた閉鎖的な場所。住民たちは長い間、巷に囁かれる「闇の鎖」の伝説を恐れてきました。それは、森の中に封じられた邪悪な存在が、一世紀ごとに町に現れ、生贄を求めて若い者たちを消えさせるという恐るべき伝説です。物語は、町に住む若者、ミカエルとエレナが中心となります。二人は「闇の鎖」の脅威に立ち向かう決意をし、町の秘密を解明しようとします。彼らは森に足を踏み入れ、伝説の真実を明らかにしようとします。しかし、森の中で二人は奇怪な出来事や幻覚に見舞われ、自分たちの運命に翻弄されていきます。町の住民たちは彼らの助けを求めますが、真実は次第に明らかになり、恐ろしい選択を迫られることになります。"闇の鎖" は、恐怖とサスペンスが絶妙に組み合わさったホラーアニメで、主人公たちが闇の中で闘い、自らの運命に立ち向かう姿を描いています。',
    keyVisual: '/image/dummy.png',
  },
];

displayAnimeList = helpers.sliceArray(
  animeList,
  maxAnimeItems
);
</script>

<style lang="scss" scoped>
.v-container {
  padding: 0 16px 16px;
}
</style>
